% 清空工作区与命令行
clear;clc
% 加载数据
x = [2010:2020]';
y1 = [412119.3  487940.2 	538580.0 	592963.2 	643563.1 688858.2 	746395.1 	832035.9 	919281.1 	986515.2 	1015986.2 ]';
y2 = [30808.0 	36302.0 	39874.0 	43684.0 	47173.0 	50237.0 	54139.0 	60014.0 	66006.0 	70581.0 	72447.0 ]';
figure(1);% 设置画布1
[y1_pre,R1]= lr(x,y1);
disp(strcat("2021年中国的国内生产总值预测值为：", num2str(y1_pre),"亿元"))
disp(strcat("第一条直线的拟合优度为：",num2str(R1)))
figure(2);% 设置画布2
[y2_pre,R2] = lr(x,y2);
disp(strcat("2021年中国的人均国内生产总值预测值为：", num2str(y2_pre), "元"))
disp(strcat("第二条直线的拟合优度为：",num2str(R2)))
